# Pandas exercise

##### از فایل زیر استفاده کنید:
##### banklist.csv
##### توجه کنید که تمامی پاسخهای این تمرین باید در یک خط کد نوشته شوند
##### نگران نباشید. سعی خود را بکنید. اگر برایتان سخت است نگاهی به راه حل بیاندازید
##### پاسخهای هر قسمت در پایین آن نوشته شده است
##### سعی کنید مرحله به مرحله به این جوابها برسید
##### --------------------------------------------------------------------------------------------------------------------------

##### فایل مورد نظر شامل اطلاعات تعدادی بانک ورشکسته در کشور امریکا است.
https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/
##### در ابتدا کتابخانه را ایمپورت کنید و فایل را در یک دیتافریم ذخیره کنید به نام
banks
##### پنج سطرآخر را نمایش دهید

In [1]:
# Code here

In [2]:
import pandas as pd
import numpy as np
banks = pd.read_csv('banklist.csv')
banks.tail(5)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
547,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,18-Nov-02
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,18-Feb-03
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
547,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,18-Nov-02
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,18-Feb-03
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05

##### دیتافریم چه ستونهایی دارد؟

In [2]:
# Code here

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

##### چند ایالت منحصر به فرد داریم؟
##### (ST : state)

In [4]:
# Code here

44

##### تمام ایالتها را نشان دهید

In [6]:
# Code here

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

___________________________________________________________________________________________________________
> ##### نکته تکمیلی:
>> ##### مرتب کردن سطرهای دیتافریم بر اساس مقادیر یک ستون:
>>> ##### df.sort_values(by='col') 
>>> (inplace=False by default)

In [8]:
# sort_values :
df1 = pd.DataFrame({'col1':[2,3,1,4],'col2':[44,55,66,44],'col3':['abc','def','ghi','xyz']})
print('Original DF:')
print(df1.head())
print('\n')

print('Sorted values (ascending) :')
print(df1.sort_values(by='col1'))
print('\n')

print('Sorted values (descending) :')
print(df1.sort_values(by='col1', ascending=False))

Original DF:
   col1  col2 col3
0     2    44  abc
1     3    55  def
2     1    66  ghi
3     4    44  xyz


Sorted values (ascending) :
   col1  col2 col3
2     1    66  ghi
0     2    44  abc
1     3    55  def
3     4    44  xyz


Sorted values (descending) :
   col1  col2 col3
3     4    44  xyz
1     3    55  def
0     2    44  abc
2     1    66  ghi

##### پنج ایالت که بیشترین بانک ورشکسته را دارند؟

In [9]:
# Code here

    Bank Name  City  CERT  Acquiring Institution  Closing Date  Updated Date
ST
MN         23    23    23                     23            23            23
CA         41    41    41                     41            41            41
IL         67    67    67                     67            67            67
FL         75    75    75                     75            75            75
GA         93    93    93                     93            93            93

##### پنج موسسه تصاحب کننده پر تکرار را بدست آورید
(acquiring institutions)

In [11]:
# Code here

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

##### چند بانک توسط این موسسه تصاحب شده است؟
State Bank of Texas

In [13]:
# Code here

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

##### همچنین چند تا از بانکهای قسمت قبل در خود  ایالت تکزاس واقع شده اند؟
( banks['ST'] == 'TX' )

In [15]:
# Code here

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

##### کدام شهر دارای بیشترین بانک ورشکسته در ایالت کالیفرنیا است؟
(banks['ST']=='CA')

In [17]:
# Code here

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

##### چند بانک ورشکسته در نام خود کلمه بانک را ندارند؟
##### Bank

In [19]:
# Code here

14

##### نام چند بانک با این حرف شروع می شود؟
S

In [21]:
# Code here

53

##### چند تا از مقادیر ستون با عنوان زیر بالای 20000 هستند؟
'CERT'

In [23]:
# Code here

417

##### نام چند بانک از دقیقا دو کلمه تشکیل شده است؟

In [25]:
# Code here

114

##### (سوال امتیازی)
##### نام بانکهای ورشکسته در سال 2008 را بدست آورید

In [27]:
# راهنمایی
pd.to_datetime(banks['Closing Date'])

0     2017-05-26
1     2017-05-05
2     2017-04-28
3     2017-03-03
4     2017-01-27
         ...
546   2001-07-27
547   2001-05-03
548   2001-02-02
549   2000-12-14
550   2000-10-13
Name: Closing Date, Length: 551, dtype: datetime64[ns]

In [28]:
# Code here

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
501,Sanderson State Bank,Sanderson,TX,11568,The Pecos County State Bank,12-Dec-08,25-Oct-13
502,Haven Trust Bank,Duluth,GA,35379,"Branch Banking & Trust Company, (BB&T)",12-Dec-08,16-Aug-12
503,First Georgia Community Bank,Jackson,GA,34301,United Bank,5-Dec-08,16-Aug-12
504,PFF Bank & Trust,Pomona,CA,28344,"U.S. Bank, N.A.",21-Nov-08,4-Jan-13
505,Downey Savings & Loan,Newport Beach,CA,30968,"U.S. Bank, N.A.",21-Nov-08,4-Jan-13
506,Community Bank,Loganville,GA,16490,Bank of Essex,21-Nov-08,4-Sep-12
507,Security Pacific Bank,Los Angeles,CA,23595,Pacific Western Bank,7-Nov-08,28-Aug-12
508,"Franklin Bank, SSB",Houston,TX,26870,Prosperity Bank,7-Nov-08,16-Aug-12
509,Freedom Bank,Bradenton,FL,57930,Fifth Third Bank,31-Oct-08,16-Aug-12
510,Alpha Bank & Trust,Alpharetta,GA,58241,"Stearns Bank, N.A.",24-Oct-08,16-Aug-12
511,Meridian Bank,Eldred,IL,13789,National Bank,10-Oct-08,31-May-12
512,Main Street Bank,Northville,MI,57654,Monroe Bank & Trust,10-Oct-08,1-Aug-13
513,Washington Mutual Bank (Including its subsidia...,Henderson,NV,32633,JP Morgan Chase Bank,25-Sep-08,4-Aug-15
514,Ameribank,Northfork,WV,6782,"The Citizens Savings Bank, Pioneer Community B...",19-Sep-08,21-Sep-15
515,Silver State Bank,Henderson,NV,34194,Nevada State Bank,5-Sep-08,25-Oct-13
516,Integrity Bank,Alpharetta,GA,35469,Regions Bank,29-Aug-08,16-Aug-12
517,Columbian Bank & Trust,Topeka,KS,22728,Citizens Bank & Trust,22-Aug-08,26-Mar-15
518,First Priority Bank,Bradenton,FL,57523,SunTrust Bank,1-Aug-08,12-Dec-16
519,"First Heritage Bank, NA",Newport Beach,CA,57961,Mutual of Omaha Bank,25-Jul-08,12-Sep-16
520,First National Bank of Nevada,Reno,NV,27011,Mutual of Omaha Bank,25-Jul-08,28-Aug-12
521,IndyMac Bank,Pasadena,CA,29730,"OneWest Bank, FSB",11-Jul-08,22-Apr-15
522,"First Integrity Bank, NA",Staples,MN,12736,First International Bank and Trust,30-May-08,20-Oct-16
523,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,9-May-08,28-Aug-12
524,Hume Bank,Hume,MO,1971,Security Bank,7-Mar-08,28-Aug-12
525,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,25-Jan-08,26-Oct-12

##### موفق باشید

##### تمامی حقوق برای رضا علوی محفوظ است